Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/moving_country/moving_to_ireland/introduction_to_the_irish_system/moving_to_ireland_and_your_social_security_entitlements.html.txt.tmx
Source language: en
Languages: ga

source: Moving to Ireland and your social security entitlements
ga: Do chearta leasa shóisialta agus tú ag bogadh go hÉirinn

source: If you are thinking of coming to Ireland to live, work, study or retire, it is important for you to be aware of the social security system in Ireland
ga: Má tá sé ar intinn agat teacht go hÉirinn chun cónaí, obair a fháil, staidéar a dhéanamh, dul ar phinsean agus araile, tá sé tábhachtach eolas a bheith agat faoin gcóras leasa shóisialta in Éirinn

source: There may be some significant differences between the system in Ireland and your home country so it will be worthwhile to familiarise yourself with the system in advance
ga: Tharlódh go mbeadh difríochtaí suntasacha idir an córas in Éirinn agus an córas i do thír dhúchais, mar sin b'fhiú duit dul i dtaithí ar an gcóras roimh ré

source: EU Regulations and Bilateral Social Security Agreements
ga: Rialacha an AE agus Comhaontú Leasa Shóisialta Déthaobhach

source: If you have come from a country covered by EU Regulations or Bilateral Social Security Agreements, your pension rights from the other country are protected when you move to Ireland
ga: Má tháinig tú as tír atá clúdaithe ag Rialacha an AE nó as tír a bhfuil Comhaontú Leasa Shóisialta Déthaobhach ag Éirinn léi, bíonn cosaint ar do chearta pinsin ón tír eile nuair a bhogann tú go hÉirinn

source: You may be able to combine your insurance records from Ireland and another country in order to qualify for a pension or social insurance payment
ga: B'fhéidir go mbeidh tú in ann do thaifead árachais Éireannaigh agus do thaifead ón tír eile a chur le chéile chun a bheith i dteideal pinsin nó sochar árachais shóisialaigh

source: Applying for a UK or other EEA pension: if you are resident in Ireland but you have never worked in Ireland you can apply for your contributory pension either to the country where you last worked, for example, the UK, or to the Department of Social Protection - see 'How to apply' below
ga: Iarratas a dhéanamh ar phinsin ón Ríocht Aontaithe nó tír LEE eile: má tá tú i do chónaí in Éirinn ach gan aon obair déanta in Éirinn agat, is féidir leat iarratas ar do phinsean ranníocach a sheoladh chuig an tír ina dhéan tú do chuid oibre, mar shampla an RA, nó iarratas a dhéanamh in Éirinn chuig an Roinn Coimirce Sóisialaí - féach 'Conas iarratas a dhéanamh' thíos

source: Many UK benefits including national insurance pensions can continue to be paid to you by the UK Department for Work and Pensions (DWP) if you move from the UK to Ireland
ga: Má bhogann tú ón Ríocht Aontaithe (RA) go hÉirinn, leanfaidh roinnt sochar lena n-áirítear pinsin árachais náisiúnta ón Department of Work and Pensions (DWP) a bheith íoctha agat

source: You should always ask in advance if you can transfer your existing UK benefits outside the UK by contacting the DWP's International Pension Centre - see 'Where to apply' below
ga: Ba chóir duit dul i dteagmháil roimh ré leis an DWP International Pension Centre – féach ‘Cá háit a ndéanfaidh mé iarratas’ thíos - agus ceist a chur maidir le do shocar láithreacha RA taobh amuigh den RA a aistriú

source: If you do not have enough social insurance contributions from another country and/or Ireland, you may qualify for an assistance-based payment that is relevant to your circumstances
ga: Muna bhfuil do dhóthain ranníocaíochtaí leasa shóisialta agat ó thír eile agus/nó Éirinn, b'fhéidir go mbeidh tú i dteideal íocaíochta atá bunaithe ar chúnamh a bhaineann le do chúinsí

source: Assistance-based payments do not relate to your social insurance record
ga: Ní bhaineann íocaíochtaí atá bunaithe ar chúnamh le do thaifead árachais shóisialta

source: Instead, the Department of Social Protection (which is responsible for the administration of the social security system in Ireland) examines all your sources of income
ga: Ina ionad sin, scrúdaíonn an Roinn Coimirce Sóisialaí (atá freagrach as riaradh an chórais leasa shóisialta in Éirinn) d'fhoinsí ioncaim uilig

source: If your income is below a certain amount, you may qualify for a payment appropriate to your needs
ga: Má bhíonn d'ioncam níos lú ná méid áirithe, b'fhéidir go mbeidh tú i dteideal íocaíochta atá oiriúnach do do riachtanais

source: There are also residency requirements for social assistance payments in Ireland
ga: Tá riachtanais maidir le gnáthchónaí le híocaíochtaí cúnaimh shóisialaigh a fháil in Éirinn

source: If you are coming from a country covered by EU Regulations (an EU/EEA country), you should bring forms U1 (formerly E301) and E104 with you
ga: Má bhíonn tú ag teacht as tír atá clúdaithe ag Rialacha an AE (is é sin tír de chuid an AE/LEE), ba cheart duit foirmeacha U1 (E301 roimhe seo) agus E104 a thabhairt leat

source: These forms are available at the relevant social security agency in the country you are coming from and provide details of your social insurance record
ga: Tá na foirmeacha seo ar fáil ón ngníomhaireach leasa shóisialta chuí sa tír a bhfuil tú ag teacht aisti agus cuireann siad sonraí do thaifid árachais shóisialta ar fáil

source: When you come to Ireland, you will need a Personal Public Service Number (PPS number)
ga: Nuair a thagann tú go hÉirinn, beidh Uimhir Phearsanta Seirbhíse Poiblí (uimhir PSP) ag teastáil uait

source: This number is a unique personal identification number that is essential for applying for State benefits and services in Ireland
ga: Is uimhir shainiúil aitheantais phearsanta í seo atá riachtanach chun iarratas a dhéanamh ar shochair stáit agus seirbhísí stáit in Éirinn

source: You can find out about claiming a Irish social welfare payment
ga: Tá tuilleadh eolais faoi íocaíocht leasa shóisialaigh a éileamh

source: Applying for a UK or other EEA pension
ga: Ag déanamh iarratas ar phinsean RA nó ar phinsean LEE eile

source: If you are resident in Ireland but you have never worked in Ireland you can apply for your contributory pension in Ireland or to the country where you last worked and paid social insurance
ga: Má tá tú i do chónaí in Éirinn ach gan aon obair déanta in Éirinn agat, is féidir leat iarratas ar do phinsean ranníocach a dhéanamh in Éirinn nó a sheoladh chuig an tír ina dhéan tú do chuid oibre agus a raibh árachas sóisialta íoctha agat

source: If you are applying in Ireland you must complete the application form EUP 65 (pdf) and send it with the relevant documents such as birth and marriage certificates to the State Pension Contributory Section of the Department of Social Protection - see 'Where to apply' below
ga: Má dhéanann tú iarratas in Éirinn caithfidh tú an fhoirm iarratais EUP 65 (pdf) a chomhlánú agus í a sheoladh le doiciméid ábhartha, mar shampla, teastais breith agus pósadh, chuig an Rannóg Phinsean Stáit Ranníocach na Ranna Coimirce Sóisialaí - féach 'Cá háit a ndéanfaidh mé iarratas' thíos

source: Your application will be then sent to the International Pension Centre in the UK or to the appropriate EEA authority
ga: Seolfar d'iarratas chuig an International Pension Centre sa RA nó chuig an údarás LEE oiriúnach

source: If you are applying to the UK for your UK State pension and you have not been sent an application form, you should contact the International Pension Centre - see 'Where to apply' below
ga: Má dhéanann tú iarratas ar do phinsean stáit RA chuig an RA agus níor sheoladh an fhoirm iarratais duit, ba chóir duit dul i dteagmháil leis an International Pension Centre - féach 'Cá háit a ndéanfaidh mé iarratas' thíos

source: Department of Social Protection
ga: An Roinn Coimirce Sóisialaí

source: Opening Hours:This office does not offer a service to personal callers
ga: Uaireanta Oscailte:Ní thairgeann an oifig seo seirbhís do chuairteoirí pearsanta

source: All queries must be made using the online enquiry form, by telephone or in writing. Tel:(071) 915 7100 Locall:1890 500 000
ga: Caithfidh gach ceist a bheith cur isteach tríd an fhoirm fiosraithe ar líne a úsáid, tríd an teileafón nó i scríbhinn
